package com.wanquan.mlmmx.mlmm.beans;

import java.io.Serializable;
import java.util.List;

/**
 * Created by Administrator on 2017/11/1.
 */

public class AntenatalTimeTableBeans implements Serializable {


    /**
     * data : {"distanceChanjianDate":0,"mapList":[{"chanjianDate":"2016-11-10","content":"建档。建立母子健康档案意味着各次产检都会在这家医院进行，宝宝也会在这里出生。一般来说建档主要为了确定孕周、推算预产期、评估妊娠风险等。\r\n\r\nNT检查。即通过B超检查胎儿是否健康。孕12周左右宝宝脖子后面会有一层透明带，染色体正常的宝宝透明带厚度小于2.5毫米，所以NT检查又叫胎儿颈后透明带检查。\r\n\r\n身高、体重。根据孕前的体重和身高计算：BMI=体重（KG）/身高的平方（M），医生会根据计算出来的值判断整个孕期体重增加多少合适，并给予建议。\r\n\r\n手检。医生会对准妈妈的甲状腺、乳房、骨盆、子宫大小进行检查，以判断宝宝生长的\u201c环境\u201d是否健康，评估准妈妈的妊娠风险。\r\n\r\n宫高、腹围。通过检查宫高和腹围这两项数据可以估算宝宝的体重和大小，评估宝宝的健康状况。\r\n\r\n血压。怀孕前后，血压可能存在变化，有规律地检查血压可以在血压刚刚升高时及时加以控制。正常血压不应超过130/90mmHg或与基础血压相比，增高不超过30/15mmHg。\r\n\r\n血型。检查准妈妈血型，进行ABO和Rh血型鉴定，预防宝宝出生后溶血症的发生。\r\n\r\n血常规。判断准妈妈是否贫血、感染及血液系统异常。准妈妈的血容量比怀孕之前增加约三分之一，通过检查白细胞、红细胞以及血小板，有助于判断准妈妈的血液健康状况。\r\n\r\n肝功能、肾功能。准妈妈承担着自身和宝宝间的营养输送和新陈代谢，肝和肾的负担较大。肝和肾的健康对宝宝的发育十分重要。\r\n\r\n传染病。排查准妈妈有无艾滋病病毒、梅毒病毒、乙肝病毒、丙肝病毒、风疹病毒、弓形虫病毒、巨细胞病毒、单纯孢疹病毒，筛查宝宝有无感染的可能。\r\n\r\n尿常规。尿糖、尿蛋白及酮体、红细胞、脓细胞测量，看是否存在尿路感染情况或指标异常，筛查有无妊娠高血压综合征。\r\n\r\n胎心率。一般医院会采用多普勒胎心仪来听胎心。胎心跳动频率是判断宝宝发育状况的重要依据，正常来说每分钟跳动120-160次。\r\n\r\n心电图。可以准确判断准妈妈有无心脏疾病、能否承受怀孕对心脏的考验。","desc":"建档、NT检查、空腹","help":"第一次产检做的检查项目相对最多，这也是为了全面检查准妈妈的健康情况，准爸爸需要一同前往，因为医生有可能还需要了解准爸爸的直系亲属及家族成员的健康情况。此外，不要忘记身份证件，同时也可带好饮用水和健康零食，以便抽血后及时补充体力。\r\n","id":111,"reminderDate":null,"seq":1,"status":1,"userId":1,"week":12},{"chanjianDate":"2016-10-13","content":"氏综合征筛查。简称\u201c唐筛\u201d，目的是检测宝宝患唐氏综合征的风险，通过抽血检查血清的方式进行检测。唐氏综合征是一种偶发性胎儿染色体异常疾病。\r\n\r\n羊膜穿刺术。又称羊水穿刺，可以分析宝宝染色体核型、检查宝宝生长发育情况。并非每个准妈妈都要做羊膜穿刺术，在宝宝患唐氏综合征风险较高（几率大于1:270）的情况下，医生才会要求准妈妈做这项手术。\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"唐筛、羊膜穿刺、空腹","help":"检查前一天晚上12点以后禁食物和水，第二天早上空腹来医院进行检查。另外，检查还与月经周期、体重、身高、准确孕周、胎龄大小有关，最好在检查前向医生咨询其他准备工作。\r\n","id":112,"reminderDate":null,"seq":2,"status":1,"userId":1,"week":16},{"chanjianDate":"2016-09-15","content":"胎儿大排畸检查。即通过B超排查胎儿发育畸形。进入孕中期后，宝宝的主要器官已成雏形，能够在B超里清晰地显现出来。大排畸检查可以对宝宝的发育状况进行仔细检查，除能扫描出宝宝的体型，还能检查出是否存在先天畸形。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"大排畸","help":"这一次产检准妈妈无需空腹，因此可以避开早高峰时段。如果本次产检准妈妈照的是四维彩超，就可以看到宝宝的实时面部表情了。照彩超之前，准妈妈需要心态放松，因为过于紧张会影响到宝宝的活动。","id":113,"reminderDate":null,"seq":3,"status":1,"userId":1,"week":20},{"chanjianDate":"2016-08-18","content":"妊娠糖尿病筛查。简称\u201c糖筛\u201d，目的是初步筛查准妈妈有无妊娠糖尿病。检查前，准妈妈需要空腹12小时，并在5分钟内口服含75g葡萄糖的液体300毫升，分别抽取服糖前、服糖后1小时、服糖后2小时的静脉血，测定血糖值。如果糖筛值超标，医生会约定时间继续做糖耐量检查，又称OGTT试验。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"唐筛、空腹","help":"此次检查前一天晚上8点以后尽量不要进食，水也少喝。做糖筛时，糖水在3-5分钟之内喝完即可，切勿一口气喝完。喝完后最好多走动，这样一个小时内能量有所消耗，可帮助降低血糖浓度。","id":114,"reminderDate":null,"seq":4,"status":1,"userId":1,"week":24},{"chanjianDate":"2016-07-21","content":"乙肝抗原复查。包含乙肝表面抗原和核心抗原两项检查，目的是检查准妈妈是否携带乙肝病毒或已感染乙型肝炎。如果两项检查都呈阳性，医生会在宝宝出生后24小时内为其注射免疫球蛋白，再接种乙肝疫苗，以降低宝宝感染的几率。如果两项检查都呈阴性，宝宝出生时就不需要接种免疫球蛋白，但仍然需要接种乙肝疫苗。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"乙肝抗原复查、空腹","help":"这时期贫血发生率增加，准妈妈务必做血常规检查，若发现贫血需要积极治疗并要在分娩前治愈。","id":115,"reminderDate":null,"seq":5,"status":1,"userId":1,"week":28},{"chanjianDate":"2016-07-07","content":"浮肿检查。孕晚期准妈妈的子宫已经扩张到一定水平，有可能会压迫到静脉，静脉回流不好的准妈妈容易出现下肢水肿现象。产检时医生会对浮肿进行检查，并根据检查结果对准妈妈进行医嘱。\r\n\r\n排查子痫前症。大部分子痫前症会在孕28周以后发生。医生通常依据准妈妈测量血压所得到的数值作为判断依据。如果发现准妈妈的血压偏高，又出现蛋白尿、全身水肿等情况，准妈妈须多加留意，尽力避免患子痫前症。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"浮肿检查、子痫前症","help":"除了去医院产检，准妈妈应在医生指导下坚持每天自数胎动，发现异常马上就医。","id":116,"reminderDate":null,"seq":6,"status":1,"userId":1,"week":30},{"chanjianDate":"2016-06-23","content":"胎心监护。它是胎心胎动宫缩图的简称，具体检查方法是用胎心率电子监护仪将20-40分钟内胎心率曲线和宫缩压力波形记下来供临床分析的图形，它是孕晚期正确评估胎儿宫内的状况的主要检测手段。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护、常规检查","help":"在32周-36周期间，产检项目会加上胎心监护。做胎心监护前，尽量多走动，或吃些点心；监护时，准妈妈可以选择一个舒服的姿势进行，避免平卧位。如果做监护的过程中宝宝不愿意动，极有可能是睡着了，可以轻轻摇晃或者拍拍腹部把宝宝唤醒。","id":117,"reminderDate":null,"seq":7,"status":1,"userId":1,"week":32},{"chanjianDate":"2016-06-09","content":"评估胎儿体重。医生将通过B超对宝宝进行详细检查，包括胎儿双顶径大小、胎盘功能分级、羊水量等。医生将凭此评估胎儿当时的体重及发育状况，并预估胎儿至足月生产时的重量。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"评估胎儿体重","help":"一般来说，出生时的实际体重与预测体重会有正负10-15%的误差。若评估出来宝宝的体重未达标，准妈妈应加强膳食营养。","id":118,"reminderDate":null,"seq":8,"status":1,"userId":1,"week":34},{"chanjianDate":"2016-05-26","content":"乙型链球菌筛查。乙型链球菌是新生儿败血病最常见的病原。产检时，医生会用专用棉棒在准妈妈的阴道口及肛门口进行会阴部的细菌采样、送验。采取剖宫产的准妈妈，需要听从医生建议是否进行该项检查。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"乙型链球菌筛查","help":"宝宝临近足月时，可能出现腹部发硬、尿频严重、胎动减少、阴道有血性分泌物等情况，这些都是临近生产的征兆，准妈妈要细心留意，并详细告知医生，请医生帮助判断。","id":119,"reminderDate":null,"seq":9,"status":1,"userId":1,"week":36},{"chanjianDate":"2016-05-19","content":"胎位检查。通过B超或手诊来查看宝宝足月时的发育状况，如大小、胎位、羊水多少等，评估宝宝是否具备顺产的条件。\r\n\r\n心电图。检查准妈妈的心脏健康状况。如果心脏图有异常，医生可能会建议进行剖宫产以确保母子平安。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护、胎位检查","help":"除了胎心监护之外，本次检查医生还会对准妈妈进行胎位检查，不过宝宝的胎位还是会在最后几周有所变化，请遵医嘱。","id":120,"reminderDate":null,"seq":10,"status":1,"userId":1,"week":37},{"chanjianDate":"2016-05-12","content":"骨盆内诊。判断是否可以顺产。骨盆的大小是由组成骨盆的各骨之间的距离（即骨盆径线）来显示的，如骨盆各径线测量值正常时，骨盆形态多属正常，宝宝多数能够顺利分娩；反之，如果骨盆过于狭窄、太小不对称、有畸形等，即使测量数值正常，也会影响宝宝的通过，可能造成难产。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护、骨盆内检","help":"骨盆内诊的结果可以帮助确定生产方式，准妈妈应该听从医生的建议，选择适合自己的生产方式，以保母子平安。此外，骨盆内诊略微有些疼痛感，准妈妈应有思想准备。","id":121,"reminderDate":null,"seq":11,"status":1,"userId":1,"week":38},{"chanjianDate":"2016-05-05","content":"胎心监护。胎心监护图上一般会有两条曲线，一条记录的是胎心率的变化，一条记录的是宫缩情况。如果在胎心监护的20-40分钟内，宝宝的胎心有一个比较稳定的速度基线，在120～160次/分钟，并且宝宝至少有两次在活动时胎心率加快，比休息时的胎心率每分钟至少快15下，每次持续至少15秒，那么胎心监护结果就是正常的。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护","help":"本次产检仍是以常规检查和胎心监护为主。不过，最重要的还是准妈妈要养成每天坚持数胎动的好习惯。","id":122,"reminderDate":null,"seq":12,"status":1,"userId":1,"week":39},{"chanjianDate":"2016-04-28","content":"胎心监护。如果宝宝活动时胎心率没有加快，或者40分钟内一次也没有动，那么结果就是\u201c无反应型\u201d。胎心监护无反应型不表示情况就一定不正常，只意味着此次监测没有提供足够的信息，准妈妈可能需要在1小时后再做一次，或者做别的检查，比如胎儿生物物理评估或宫缩应激试验。如果医生认为你的宝宝在子宫里状况不太好，可能会建议准妈妈剖宫产。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护","help":"到了预产期，这时候的产检除了一些常规检查之外，最重要的就是胎心监护，保证宝宝和准妈妈的安全。如果通过胎心监护医生认为宝宝在子宫里状况不太好，可能会建议准妈妈剖宫产。","id":123,"reminderDate":null,"seq":13,"status":1,"userId":1,"week":40}]}
     * dynamicKey :
     * msg :
     * result : true
     * resultCode : 1
     * token :
     */

    private DataBean data;
    private String dynamicKey;
    private String msg;
    private String result;
    private int resultCode;
    private String token;

    public DataBean getData() {
        return data;
    }

    public void setData(DataBean data) {
        this.data = data;
    }

    public String getDynamicKey() {
        return dynamicKey;
    }

    public void setDynamicKey(String dynamicKey) {
        this.dynamicKey = dynamicKey;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public String getResult() {
        return result;
    }

    public void setResult(String result) {
        this.result = result;
    }

    public int getResultCode() {
        return resultCode;
    }

    public void setResultCode(int resultCode) {
        this.resultCode = resultCode;
    }

    public String getToken() {
        return token;
    }

    public void setToken(String token) {
        this.token = token;
    }

    public static class DataBean {
        /**
         * distanceChanjianDate : 0
         * mapList : [{"chanjianDate":"2016-11-10","content":"建档。建立母子健康档案意味着各次产检都会在这家医院进行，宝宝也会在这里出生。一般来说建档主要为了确定孕周、推算预产期、评估妊娠风险等。\r\n\r\nNT检查。即通过B超检查胎儿是否健康。孕12周左右宝宝脖子后面会有一层透明带，染色体正常的宝宝透明带厚度小于2.5毫米，所以NT检查又叫胎儿颈后透明带检查。\r\n\r\n身高、体重。根据孕前的体重和身高计算：BMI=体重（KG）/身高的平方（M），医生会根据计算出来的值判断整个孕期体重增加多少合适，并给予建议。\r\n\r\n手检。医生会对准妈妈的甲状腺、乳房、骨盆、子宫大小进行检查，以判断宝宝生长的\u201c环境\u201d是否健康，评估准妈妈的妊娠风险。\r\n\r\n宫高、腹围。通过检查宫高和腹围这两项数据可以估算宝宝的体重和大小，评估宝宝的健康状况。\r\n\r\n血压。怀孕前后，血压可能存在变化，有规律地检查血压可以在血压刚刚升高时及时加以控制。正常血压不应超过130/90mmHg或与基础血压相比，增高不超过30/15mmHg。\r\n\r\n血型。检查准妈妈血型，进行ABO和Rh血型鉴定，预防宝宝出生后溶血症的发生。\r\n\r\n血常规。判断准妈妈是否贫血、感染及血液系统异常。准妈妈的血容量比怀孕之前增加约三分之一，通过检查白细胞、红细胞以及血小板，有助于判断准妈妈的血液健康状况。\r\n\r\n肝功能、肾功能。准妈妈承担着自身和宝宝间的营养输送和新陈代谢，肝和肾的负担较大。肝和肾的健康对宝宝的发育十分重要。\r\n\r\n传染病。排查准妈妈有无艾滋病病毒、梅毒病毒、乙肝病毒、丙肝病毒、风疹病毒、弓形虫病毒、巨细胞病毒、单纯孢疹病毒，筛查宝宝有无感染的可能。\r\n\r\n尿常规。尿糖、尿蛋白及酮体、红细胞、脓细胞测量，看是否存在尿路感染情况或指标异常，筛查有无妊娠高血压综合征。\r\n\r\n胎心率。一般医院会采用多普勒胎心仪来听胎心。胎心跳动频率是判断宝宝发育状况的重要依据，正常来说每分钟跳动120-160次。\r\n\r\n心电图。可以准确判断准妈妈有无心脏疾病、能否承受怀孕对心脏的考验。","desc":"建档、NT检查、空腹","help":"第一次产检做的检查项目相对最多，这也是为了全面检查准妈妈的健康情况，准爸爸需要一同前往，因为医生有可能还需要了解准爸爸的直系亲属及家族成员的健康情况。此外，不要忘记身份证件，同时也可带好饮用水和健康零食，以便抽血后及时补充体力。\r\n","id":111,"reminderDate":null,"seq":1,"status":1,"userId":1,"week":12},{"chanjianDate":"2016-10-13","content":"氏综合征筛查。简称\u201c唐筛\u201d，目的是检测宝宝患唐氏综合征的风险，通过抽血检查血清的方式进行检测。唐氏综合征是一种偶发性胎儿染色体异常疾病。\r\n\r\n羊膜穿刺术。又称羊水穿刺，可以分析宝宝染色体核型、检查宝宝生长发育情况。并非每个准妈妈都要做羊膜穿刺术，在宝宝患唐氏综合征风险较高（几率大于1:270）的情况下，医生才会要求准妈妈做这项手术。\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"唐筛、羊膜穿刺、空腹","help":"检查前一天晚上12点以后禁食物和水，第二天早上空腹来医院进行检查。另外，检查还与月经周期、体重、身高、准确孕周、胎龄大小有关，最好在检查前向医生咨询其他准备工作。\r\n","id":112,"reminderDate":null,"seq":2,"status":1,"userId":1,"week":16},{"chanjianDate":"2016-09-15","content":"胎儿大排畸检查。即通过B超排查胎儿发育畸形。进入孕中期后，宝宝的主要器官已成雏形，能够在B超里清晰地显现出来。大排畸检查可以对宝宝的发育状况进行仔细检查，除能扫描出宝宝的体型，还能检查出是否存在先天畸形。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"大排畸","help":"这一次产检准妈妈无需空腹，因此可以避开早高峰时段。如果本次产检准妈妈照的是四维彩超，就可以看到宝宝的实时面部表情了。照彩超之前，准妈妈需要心态放松，因为过于紧张会影响到宝宝的活动。","id":113,"reminderDate":null,"seq":3,"status":1,"userId":1,"week":20},{"chanjianDate":"2016-08-18","content":"妊娠糖尿病筛查。简称\u201c糖筛\u201d，目的是初步筛查准妈妈有无妊娠糖尿病。检查前，准妈妈需要空腹12小时，并在5分钟内口服含75g葡萄糖的液体300毫升，分别抽取服糖前、服糖后1小时、服糖后2小时的静脉血，测定血糖值。如果糖筛值超标，医生会约定时间继续做糖耐量检查，又称OGTT试验。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"唐筛、空腹","help":"此次检查前一天晚上8点以后尽量不要进食，水也少喝。做糖筛时，糖水在3-5分钟之内喝完即可，切勿一口气喝完。喝完后最好多走动，这样一个小时内能量有所消耗，可帮助降低血糖浓度。","id":114,"reminderDate":null,"seq":4,"status":1,"userId":1,"week":24},{"chanjianDate":"2016-07-21","content":"乙肝抗原复查。包含乙肝表面抗原和核心抗原两项检查，目的是检查准妈妈是否携带乙肝病毒或已感染乙型肝炎。如果两项检查都呈阳性，医生会在宝宝出生后24小时内为其注射免疫球蛋白，再接种乙肝疫苗，以降低宝宝感染的几率。如果两项检查都呈阴性，宝宝出生时就不需要接种免疫球蛋白，但仍然需要接种乙肝疫苗。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"乙肝抗原复查、空腹","help":"这时期贫血发生率增加，准妈妈务必做血常规检查，若发现贫血需要积极治疗并要在分娩前治愈。","id":115,"reminderDate":null,"seq":5,"status":1,"userId":1,"week":28},{"chanjianDate":"2016-07-07","content":"浮肿检查。孕晚期准妈妈的子宫已经扩张到一定水平，有可能会压迫到静脉，静脉回流不好的准妈妈容易出现下肢水肿现象。产检时医生会对浮肿进行检查，并根据检查结果对准妈妈进行医嘱。\r\n\r\n排查子痫前症。大部分子痫前症会在孕28周以后发生。医生通常依据准妈妈测量血压所得到的数值作为判断依据。如果发现准妈妈的血压偏高，又出现蛋白尿、全身水肿等情况，准妈妈须多加留意，尽力避免患子痫前症。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"浮肿检查、子痫前症","help":"除了去医院产检，准妈妈应在医生指导下坚持每天自数胎动，发现异常马上就医。","id":116,"reminderDate":null,"seq":6,"status":1,"userId":1,"week":30},{"chanjianDate":"2016-06-23","content":"胎心监护。它是胎心胎动宫缩图的简称，具体检查方法是用胎心率电子监护仪将20-40分钟内胎心率曲线和宫缩压力波形记下来供临床分析的图形，它是孕晚期正确评估胎儿宫内的状况的主要检测手段。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护、常规检查","help":"在32周-36周期间，产检项目会加上胎心监护。做胎心监护前，尽量多走动，或吃些点心；监护时，准妈妈可以选择一个舒服的姿势进行，避免平卧位。如果做监护的过程中宝宝不愿意动，极有可能是睡着了，可以轻轻摇晃或者拍拍腹部把宝宝唤醒。","id":117,"reminderDate":null,"seq":7,"status":1,"userId":1,"week":32},{"chanjianDate":"2016-06-09","content":"评估胎儿体重。医生将通过B超对宝宝进行详细检查，包括胎儿双顶径大小、胎盘功能分级、羊水量等。医生将凭此评估胎儿当时的体重及发育状况，并预估胎儿至足月生产时的重量。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"评估胎儿体重","help":"一般来说，出生时的实际体重与预测体重会有正负10-15%的误差。若评估出来宝宝的体重未达标，准妈妈应加强膳食营养。","id":118,"reminderDate":null,"seq":8,"status":1,"userId":1,"week":34},{"chanjianDate":"2016-05-26","content":"乙型链球菌筛查。乙型链球菌是新生儿败血病最常见的病原。产检时，医生会用专用棉棒在准妈妈的阴道口及肛门口进行会阴部的细菌采样、送验。采取剖宫产的准妈妈，需要听从医生建议是否进行该项检查。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"乙型链球菌筛查","help":"宝宝临近足月时，可能出现腹部发硬、尿频严重、胎动减少、阴道有血性分泌物等情况，这些都是临近生产的征兆，准妈妈要细心留意，并详细告知医生，请医生帮助判断。","id":119,"reminderDate":null,"seq":9,"status":1,"userId":1,"week":36},{"chanjianDate":"2016-05-19","content":"胎位检查。通过B超或手诊来查看宝宝足月时的发育状况，如大小、胎位、羊水多少等，评估宝宝是否具备顺产的条件。\r\n\r\n心电图。检查准妈妈的心脏健康状况。如果心脏图有异常，医生可能会建议进行剖宫产以确保母子平安。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护、胎位检查","help":"除了胎心监护之外，本次检查医生还会对准妈妈进行胎位检查，不过宝宝的胎位还是会在最后几周有所变化，请遵医嘱。","id":120,"reminderDate":null,"seq":10,"status":1,"userId":1,"week":37},{"chanjianDate":"2016-05-12","content":"骨盆内诊。判断是否可以顺产。骨盆的大小是由组成骨盆的各骨之间的距离（即骨盆径线）来显示的，如骨盆各径线测量值正常时，骨盆形态多属正常，宝宝多数能够顺利分娩；反之，如果骨盆过于狭窄、太小不对称、有畸形等，即使测量数值正常，也会影响宝宝的通过，可能造成难产。\r\n\r\n基础检查。包括胎心监护、体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护、骨盆内检","help":"骨盆内诊的结果可以帮助确定生产方式，准妈妈应该听从医生的建议，选择适合自己的生产方式，以保母子平安。此外，骨盆内诊略微有些疼痛感，准妈妈应有思想准备。","id":121,"reminderDate":null,"seq":11,"status":1,"userId":1,"week":38},{"chanjianDate":"2016-05-05","content":"胎心监护。胎心监护图上一般会有两条曲线，一条记录的是胎心率的变化，一条记录的是宫缩情况。如果在胎心监护的20-40分钟内，宝宝的胎心有一个比较稳定的速度基线，在120～160次/分钟，并且宝宝至少有两次在活动时胎心率加快，比休息时的胎心率每分钟至少快15下，每次持续至少15秒，那么胎心监护结果就是正常的。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护","help":"本次产检仍是以常规检查和胎心监护为主。不过，最重要的还是准妈妈要养成每天坚持数胎动的好习惯。","id":122,"reminderDate":null,"seq":12,"status":1,"userId":1,"week":39},{"chanjianDate":"2016-04-28","content":"胎心监护。如果宝宝活动时胎心率没有加快，或者40分钟内一次也没有动，那么结果就是\u201c无反应型\u201d。胎心监护无反应型不表示情况就一定不正常，只意味着此次监测没有提供足够的信息，准妈妈可能需要在1小时后再做一次，或者做别的检查，比如胎儿生物物理评估或宫缩应激试验。如果医生认为你的宝宝在子宫里状况不太好，可能会建议准妈妈剖宫产。\r\n\r\n基础检查。包括体重、宫高、腹围、血压、胎心率、血常规、尿常规等检查项目。","desc":"胎心监护","help":"到了预产期，这时候的产检除了一些常规检查之外，最重要的就是胎心监护，保证宝宝和准妈妈的安全。如果通过胎心监护医生认为宝宝在子宫里状况不太好，可能会建议准妈妈剖宫产。","id":123,"reminderDate":null,"seq":13,"status":1,"userId":1,"week":40}]
         */

        private int distanceChanjianDate;
        private List<MapListBean> mapList;

        public int getDistanceChanjianDate() {
            return distanceChanjianDate;
        }

        public void setDistanceChanjianDate(int distanceChanjianDate) {
            this.distanceChanjianDate = distanceChanjianDate;
        }

        public List<MapListBean> getMapList() {
            return mapList;
        }

        public void setMapList(List<MapListBean> mapList) {
            this.mapList = mapList;
        }

        public static class MapListBean {
            /**
             * chanjianDate : 2016-11-10
             * content : 建档。建立母子健康档案意味着各次产检都会在这家医院进行，宝宝也会在这里出生。一般来说建档主要为了确定孕周、推算预产期、评估妊娠风险等。

             NT检查。即通过B超检查胎儿是否健康。孕12周左右宝宝脖子后面会有一层透明带，染色体正常的宝宝透明带厚度小于2.5毫米，所以NT检查又叫胎儿颈后透明带检查。

             身高、体重。根据孕前的体重和身高计算：BMI=体重（KG）/身高的平方（M），医生会根据计算出来的值判断整个孕期体重增加多少合适，并给予建议。

             手检。医生会对准妈妈的甲状腺、乳房、骨盆、子宫大小进行检查，以判断宝宝生长的“环境”是否健康，评估准妈妈的妊娠风险。

             宫高、腹围。通过检查宫高和腹围这两项数据可以估算宝宝的体重和大小，评估宝宝的健康状况。

             血压。怀孕前后，血压可能存在变化，有规律地检查血压可以在血压刚刚升高时及时加以控制。正常血压不应超过130/90mmHg或与基础血压相比，增高不超过30/15mmHg。

             血型。检查准妈妈血型，进行ABO和Rh血型鉴定，预防宝宝出生后溶血症的发生。

             血常规。判断准妈妈是否贫血、感染及血液系统异常。准妈妈的血容量比怀孕之前增加约三分之一，通过检查白细胞、红细胞以及血小板，有助于判断准妈妈的血液健康状况。

             肝功能、肾功能。准妈妈承担着自身和宝宝间的营养输送和新陈代谢，肝和肾的负担较大。肝和肾的健康对宝宝的发育十分重要。

             传染病。排查准妈妈有无艾滋病病毒、梅毒病毒、乙肝病毒、丙肝病毒、风疹病毒、弓形虫病毒、巨细胞病毒、单纯孢疹病毒，筛查宝宝有无感染的可能。

             尿常规。尿糖、尿蛋白及酮体、红细胞、脓细胞测量，看是否存在尿路感染情况或指标异常，筛查有无妊娠高血压综合征。

             胎心率。一般医院会采用多普勒胎心仪来听胎心。胎心跳动频率是判断宝宝发育状况的重要依据，正常来说每分钟跳动120-160次。

             心电图。可以准确判断准妈妈有无心脏疾病、能否承受怀孕对心脏的考验。
             * desc : 建档、NT检查、空腹
             * help : 第一次产检做的检查项目相对最多，这也是为了全面检查准妈妈的健康情况，准爸爸需要一同前往，因为医生有可能还需要了解准爸爸的直系亲属及家族成员的健康情况。此外，不要忘记身份证件，同时也可带好饮用水和健康零食，以便抽血后及时补充体力。

             * id : 111
             * reminderDate : null
             * seq : 1
             * status : 1
             * userId : 1
             * week : 12
             */

            private String chanjianDate;
            private String content;
            private String desc;
            private String help;
            private int id;
            private Object reminderDate;
            private int seq;
            private int status;
            private int userId;
            private int week;

            public String getChanjianDate() {
                return chanjianDate;
            }

            public void setChanjianDate(String chanjianDate) {
                this.chanjianDate = chanjianDate;
            }

            public String getContent() {
                return content;
            }

            public void setContent(String content) {
                this.content = content;
            }

            public String getDesc() {
                return desc;
            }

            public void setDesc(String desc) {
                this.desc = desc;
            }

            public String getHelp() {
                return help;
            }

            public void setHelp(String help) {
                this.help = help;
            }

            public int getId() {
                return id;
            }

            public void setId(int id) {
                this.id = id;
            }

            public Object getReminderDate() {
                return reminderDate;
            }

            public void setReminderDate(Object reminderDate) {
                this.reminderDate = reminderDate;
            }

            public int getSeq() {
                return seq;
            }

            public void setSeq(int seq) {
                this.seq = seq;
            }

            public int getStatus() {
                return status;
            }

            public void setStatus(int status) {
                this.status = status;
            }

            public int getUserId() {
                return userId;
            }

            public void setUserId(int userId) {
                this.userId = userId;
            }

            public int getWeek() {
                return week;
            }

            public void setWeek(int week) {
                this.week = week;
            }
        }
    }
}
